[
  {
    "title": "STA-TCN: Neural Decoder for Upper Limb Rehabilitation",
    "year": 2024,
    "image": "figures/STA-TCN Neural Decoder for Upper Limb Rehabilitation.png",
    "description": "Continuous motion prediction using sEMG for cable-driven exoskeletons. A Spatio-Temporal Attention and lightweight Temporal Convolutional Network (STA-TCN) architecture for subject-independent, real-time estimation of elbow joint angles."
  },
  {
    "title": "Robotic Catheter System for Cardiac Ablation",
    "year": 2024,
    "image": "figures/Robotic Catheter System for Cardiac Ablation.png",
    "description": "Robot-assisted catheter ablation system improving precision, safety and feedback. Development of a robot ablation catheter system for cardiac ablation therapy, aimed at improving the precision, safety and usability of catheter-based treatments for atrial fibrillation."
  },
  {
    "title": "Automated Analog IC Layout System",
    "year": 2023,
    "image": "figures/Automated Analog IC Layout System(1).png",
    "description": "Automated layout generation for matched resistors and capacitors. This project tackles the problem of device mismatch in analog integrated circuits by developing an automated layout generation system."
  },
  {
    "title": "RRT Motion Planner",
    "year": 2023,
    "image": "figures/RRT Motion Planner.png",
    "description": "Rapidly-exploring random tree motion planner for a manipulator. Course project implementing a rapidly-exploring random tree (RRT) algorithm to plan collision-free paths for a robotic arm."
  },
  {
    "title": "Fynthesizer",
    "year": 2023,
    "image": "figures/Fynthesizer.jpg",
    "description": "Modular audio synthesizer. Designed and built a small audio synthesizer as a course project, focusing on modular sound generation and signal processing."
  },
  {
    "title": "Vision-Controlled Vibrating Robot",
    "year": 2022,
    "image": "figures/Vision-Controlled Vibrating Robot.png",
    "description": "Vibrating robot controlled via computer vision. Created a robot that uses computer-vision feedback to control a vibrating platform for remote exploration and manipulation tasks."
  },
  {
    "title": "Data Visualization Dashboard",
    "year": 2024,
    "image": "https://dsc106.com/labs/lab02/images/empty.svg",
    "description": "Interactive data visualization dashboard for analyzing healthcare metrics. Built with D3.js and React to provide real-time insights into patient data and treatment outcomes."
  },
  {
    "title": "Machine Learning Model Optimizer",
    "year": 2023,
    "image": "https://dsc106.com/labs/lab02/images/empty.svg",
    "description": "Automated hyperparameter tuning system for deep learning models. Implemented using Bayesian optimization to reduce training time by 40% while improving model accuracy."
  },
  {
    "title": "Smart Home IoT System",
    "year": 2022,
    "image": "https://dsc106.com/labs/lab02/images/empty.svg",
    "description": "Integrated IoT system for home automation using Arduino and Raspberry Pi. Features include voice control, automated lighting, and energy monitoring with mobile app interface."
  },
  {
    "title": "Natural Language Processing Chatbot",
    "year": 2024,
    "image": "https://dsc106.com/labs/lab02/images/empty.svg",
    "description": "AI-powered customer service chatbot using transformer-based models. Deployed on cloud infrastructure with 95% accuracy in intent classification and multilingual support."
  },
  {
    "title": "Computer Vision Object Detection",
    "year": 2023,
    "image": "https://dsc106.com/labs/lab02/images/empty.svg",
    "description": "Real-time object detection system for autonomous vehicles. Implemented using YOLO architecture with custom training on driving scenarios to achieve 30 FPS performance."
  },
  {
    "title": "Blockchain Supply Chain Tracker",
    "year": 2022,
    "image": "https://dsc106.com/labs/lab02/images/empty.svg",
    "description": "Decentralized supply chain management system using Ethereum smart contracts. Provides transparent tracking of products from manufacture to delivery with immutable records."
  }
]

